### Contents
### 1.0 import libraries
### 2.0 import data
### 3.0 prepare dataframes
### 4.0 combine dataframes
### 5.0 export data

## 1.0 Import libraries

In [62]:
#import libraries
import pandas as pd
import numpy as np
import os

## 2.0 import data

In [63]:
#create path
path = r'C:\Users\Asus 17\OneDrive\Desktop\Achievement 4\instacart_basket_analysis'

In [64]:
#import ords_prods
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [65]:
# import prods
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

## 3.0 prepare dataframes

In [66]:
#look at ords_prods
df_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [67]:
df_ords_prods.shape

(32434489, 10)

### drop _merge

In [68]:
#make a new dataframe ohne merge
df_ords_prods_clean = df_ords_prods.drop(columns = ['_merge'])

In [69]:
# check it out
df_ords_prods_clean.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [70]:
#check its shape
df_ords_prods_clean.shape

(32434489, 9)

In [71]:
#overwrite df_ords_prods
df_ords_prods = df_ords_prods_clean

In [72]:
#check
df_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [73]:
#and shape
df_ords_prods.shape

(32434489, 9)

In [74]:
#look at prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

### fix up df_prods

In [75]:
# rename the columns to drop the index
df_prods.columns = ['bad', 'product_it', 'product_name', 'ailse_id', 'department_id', 'prices']

In [76]:
#check
df_prods.head()

,bad,product_it,product_name,ailse_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [77]:
#drop bad
df_prods_clean = df_prods.drop(columns = ['bad'])

In [78]:
#take a look
df_prods_clean.head()

,product_it,product_name,ailse_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [79]:
#overwrite df_prods
df_prods = df_prods_clean

In [80]:
#check
df_prods.head()

,product_it,product_name,ailse_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [81]:
# fix typo in product_it
df_prods.rename(columns = {'product_it' : 'product_id'}, inplace = True)

In [82]:
#check
df_prods.head()

,product_id,product_name,ailse_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [83]:
# and in ailse_id
df_prods.rename(columns = {'ailse_id' : 'aisle_id'}, inplace = True)

In [84]:
#check
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [85]:
df_prods.shape

(49672, 5)

## 4.0 combine dataframes

In [90]:
# create a merged dataframe
df_orders_products_merged = df_ords_prods.merge(df_prods, on = 'product_id', indicator = True)

In [91]:
#have a look
df_orders_products_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [92]:
#check its shape
df_orders_products_merged.shape

(32404859, 14)

In [89]:
# check ords_prods shape
df_ords_prods.shape

(32434489, 9)

In [93]:
#check the _merge value counts
df_orders_products_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

## 5.0 export data

In [94]:
#export merge as pkl
df_orders_products_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))

In [95]:
#export repaird prods
df_prods.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))